docs/google_cloud_platform.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-08-28 Tue 16:57 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Google Cloud Platform</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Jethro Kuan" />
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Google Cloud Platform</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org9a4f05d">1. Cloud ML</a></li>
</ul>
</div>
</div>
<div id="outline-container-org9a4f05d" class="outline-2">
<h2 id="org9a4f05d"><span class="section-number-2">1</span> Cloud ML</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Exactly one replica is designated the master. This task manages the
others and reports status for the job as a whole. The training
service runs until your job succeeds or encounters an unrecoverable
error. In the distributed case, it is the status of the master
replica that signals the overall job status.</li>
<li>If you are running a single-process job, the sole replica is the
master for the job.</li>
<li>One or more replicas may be designated as workers. These replicas do
their portion of the work as you designate in your job
configuration.</li>
<li>One or more replicas may be designated as parameter servers. These
replicas coordinate shared model state between the workers.</li>
</ul>

<p>
For more on the distributed training flow, see
<a href="https://cloud.google.com/ml-engine/docs/tensorflow/distributed-tensorflow-mnist-cloud-datalab">https://cloud.google.com/ml-engine/docs/tensorflow/distributed-tensorflow-mnist-cloud-datalab</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Jethro Kuan</p>
<p class="date">Created: 2018-08-28 Tue 16:57</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
